[
    {
        "role": "Software Engineer",
        "company_name": "BioNTech US, BioNTech SE",
        "company_link": "https://www.biontech.com/int/en/home.html",
        "start_date": "2023-06-12T04:00:00.00Z",
        "end_date": null,
        "descriptions": [
            "Engineer scalable cloud-based bioinformatics workflows using Nextflow, cutting analysis runtime from overnights to hours and automating processes to accelerate research timelines.",
            "Collaborate with cross-site teams to design and implement components of a centralized internal database, supporting organizational goals and data accessibility.",
            "Suport CI/CD pipeline best practices, version control, and documentation standards to ensure reproducible workflows and seamless team collaboration."
        ],
        "skills": [
            "Python",
            "Nextflow",
            "Docker",
            "AWS",
            "Git"
        ]
    },
    {
        "role": "Software Engineer",
        "company_name": "BlueSphere Bio",
        "company_link": "https://bluespherebio.com/",
        "start_date": "2021-02-16T05:00:00.00Z",
        "end_date": "2023-06-02T04:00:00.00Z",
        "descriptions": [
            "Developed Nextflow-driven workflow management platform using Next.js and FastAPI, delivering real-time progress monitoring, user-specific permissions, and intermediate result access for enhanced operational transparency.",
            "Co-authored two patent filings, contributing to proprietary datasets and designing a scalable data management platform that boosted research throughput.",
            "Transformed hybrid server architecture by integrating Slurm HPC clusters and centralized user authentication via LDAP, resulting in optimized computational resource allocation.",
            "Achieved a 40% reduction in expected AWS costs by optimizing S3 and Storage Gateway usage, maintaining high system availability without compromising performance. "
        ],
        "skills": [
            "Next.js",
            "FastAPI",
            "Nextflow",
            "React",
            "TypeScript",
            "JavaScript",
            "HPC"
        ]
    }
]
